In [9]:
import numpy as np
import pandas as pd

In [10]:
from numpy.random import randn

In [11]:
np.random.seed(101)

In [12]:
df = pd.DataFrame

In [16]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  1.025984 -0.156598 -0.031579  0.649826
B  2.154846 -0.610259 -0.755325 -0.346419
C  0.147027 -0.479448  0.558769  1.024810
D -0.925874  1.862864 -1.133817  0.610478
E  0.386030  2.084019 -0.376519  0.230336

In [8]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [9]:
type(df['W'])

pandas.core.series.Series

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.X

A    0.196800
B   -0.156598
C   -0.610259
D   -0.479448
E    1.862864
Name: X, dtype: float64

In [12]:
df[['W','Y']]

          W         Y
A -0.993263 -1.136645
B  1.025984 -0.031579
C  2.154846 -0.755325
D  0.147027  0.558769
E -0.925874 -1.133817

In [13]:
# creating a new column to DF
df['New'] = df['W'] + df['Y']

In [14]:
df

          W         X         Y         Z       New
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [17]:
df.drop('New', axis=1, inplace=True) # droping a 'New' column

In [18]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [25]:
# drip the E row
df.drop('E', axis=0, inplace=True)

In [26]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [27]:
df.shape

(4, 4)

In [28]:
# selecting row
df.loc['A']

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [29]:
df.iloc[2] # numerical base index

W    2.154846
X   -0.610259
Y   -0.755325
Z   -0.346419
Name: C, dtype: float64

In [30]:
df.loc['A','W']

-0.993263499973366

In [32]:
df.loc[ ['A','B'] , ['W','Y']]

          W         Y
A -0.993263 -1.136645
B  1.025984 -0.031579

In [37]:
# conditional selection
booldf = df > 0

In [39]:
df[booldf]

          W       X         Y         Z
A       NaN  0.1968       NaN  0.000366
B  1.025984     NaN       NaN  0.649826
C  2.154846     NaN       NaN       NaN
D  0.147027     NaN  0.558769  1.024810

In [40]:
df[df > 0]

          W       X         Y         Z
A       NaN  0.1968       NaN  0.000366
B  1.025984     NaN       NaN  0.649826
C  2.154846     NaN       NaN       NaN
D  0.147027     NaN  0.558769  1.024810

In [41]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [42]:
df['W'] > 0

A    False
B     True
C     True
D     True
Name: W, dtype: bool

In [45]:
df[df['W'] > 0]

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [47]:
xdf[df['Z'] < 0]

          W         X         Y         Z
C  2.154846 -0.610259 -0.755325 -0.346419

In [50]:
df[df['W'] > 0][['Y','X']]

          Y         X
B -0.031579 -0.156598
C -0.755325 -0.610259
D  0.558769 -0.479448

In [54]:
boolser = df['X'] > 0
result = df[boolser]

mycols = ['Y', 'X']
result[mycols]

          Y       X
A -1.136645  0.1968

In [56]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [63]:
# multiple conditional

df[(df['W'] >= 2) | (df['Z'] < 0)]

          W         X         Y         Z
C  2.154846 -0.610259 -0.755325 -0.346419

In [64]:
# index

In [65]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810

In [69]:
newind = 'CA NY WY OR'.split()
newind

['CA', 'NY', 'WY', 'OR']

In [70]:
df['States'] = newind

In [71]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR

In [72]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810